IdeaRS.Connections
AddedMemberData.LCSYVectX Property
Compatible with IDEA StatiCa 0.0
 Gets or sets X value of the Y vector of the local coordinate system of the beam segment
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double LCSYVectX { get; set; }
Property Value
Type: Double
See Also
Reference
AddedMemberData Class
IdeaRS.Connections.Data Namespace